In [1]:
import pandas as pd

### Задание 1

Используйте файл с оценками фильмов ml-latest-small/ratings.csv. Посчитайте среднее время жизни пользователей, которые выставили более 100 оценок. Под временем жизни понимается разница между максимальным и минимальным значением столбца timestamp для данного значения userId.

In [35]:
file_raitings = pd.read_csv('C:/Netology/PYDA_14/10_Pandas (продвинутый)/ml-latest-small/ratings.csv')

In [82]:
file_raitings.head()

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144
1       1     1029     3.0  1260759179
2       1     1061     3.0  1260759182
3       1     1129     2.0  1260759185
4       1     1172     4.0  1260759205

In [115]:
file_raitings['count'] = file_raitings.groupby('userId')['userId'].transform('count')

In [116]:
file_raitings.head()

   userId  movieId  rating   timestamp  count
0       1       31     2.5  1260759144     20
1       1     1029     3.0  1260759179     20
2       1     1061     3.0  1260759182     20
3       1     1129     2.0  1260759185     20
4       1     1172     4.0  1260759205     20

In [117]:
file_raitings = file_raitings.loc[file_raitings['count'] > 100]

In [118]:
file_raitings.head()

     userId  movieId  rating  timestamp  count
147       4       10     4.0  949810645    204
148       4       34     5.0  949919556    204
149       4      112     5.0  949810582    204
150       4      141     5.0  949919681    204
151       4      153     4.0  949811346    204

In [119]:
filtred_df = file_raitings[['userId', 'timestamp']]

In [123]:
filtred_df = filtred_df.groupby('userId').agg([min, max])

In [124]:
filtred_df['livetime'] = filtred_df['timestamp']['max'] - filtred_df['timestamp']['min']

In [125]:
filtred_df.head()

         timestamp               livetime
               min         max
userId
4        949778714   949982274     203560
8       1154389340  1154474527      85187
15       997937239  1469330735  471393496
17      1127468587  1127476640       8053
19       855190091   855195373       5282

In [126]:
filtred_df['livetime'].mean()

40080507.4496124

In [129]:
pd.to_datetime(filtred_df['livetime'].mean(), unit='s')

Timestamp('1971-04-09 21:28:27.449612401')

In [130]:
filtred_df['livetime'].mean()/60/60/24

463.89476214829165

### Задание 2

Дана статистика услуг перевозок клиентов компании по типам (см. файл с кодом занятия). 

Необходимо сформировать две таблицы:
- таблицу с тремя типами выручки для каждого client_id без указания адреса клиента
- аналогичную таблицу по типам выручки с указанием адреса клиента

Обратите внимание, что в процессе объединения таблиц данные не должны теряться.

#### К домашнему заданию, задача 2
Дана статистика услуг перевозок клиентов компании по типам:
- rzd - железнодорожные перевозки
- auto - автомобильные перевозки
- air - воздушные перевозки
- client_base - адреса клиентов

In [132]:
rzd = pd.DataFrame(
    {
        'client_id': [111, 112, 113, 114, 115],
        'rzd_revenue': [1093, 2810, 10283, 5774, 981]
    }
)
rzd

   client_id  rzd_revenue
0        111         1093
1        112         2810
2        113        10283
3        114         5774
4        115          981

In [133]:
auto = pd.DataFrame(
    {
        'client_id': [113, 114, 115, 116, 117],
        'auto_revenue': [57483, 83, 912, 4834, 98]
    }
)
auto

   client_id  auto_revenue
0        113         57483
1        114            83
2        115           912
3        116          4834
4        117            98

In [134]:
air = pd.DataFrame(
    {
        'client_id': [115, 116, 117, 118],
        'air_revenue': [81, 4, 13, 173]
    }
)
air

   client_id  air_revenue
0        115           81
1        116            4
2        117           13
3        118          173

In [135]:
client_base = pd.DataFrame(
    {
        'client_id': [111, 112, 113, 114, 115, 116, 117, 118],
        'address': ['Комсомольская 4', 'Энтузиастов 8а', 'Левобережная 1а', 'Мира 14', 'ЗЖБИиДК 1', 
                    'Строителей 18', 'Панфиловская 33', 'Мастеркова 4']
    }
)
client_base

   client_id          address
0        111  Комсомольская 4
1        112   Энтузиастов 8а
2        113  Левобережная 1а
3        114          Мира 14
4        115        ЗЖБИиДК 1
5        116    Строителей 18
6        117  Панфиловская 33
7        118     Мастеркова 4

In [136]:
table_1 = rzd.merge(auto, how='outer', on='client_id')

In [138]:
table_1 = table_1.merge(air, how='outer', on='client_id')

In [139]:
table_1

   client_id  rzd_revenue  auto_revenue  air_revenue
0        111       1093.0           NaN          NaN
1        112       2810.0           NaN          NaN
2        113      10283.0       57483.0          NaN
3        114       5774.0          83.0          NaN
4        115        981.0         912.0         81.0
5        116          NaN        4834.0          4.0
6        117          NaN          98.0         13.0
7        118          NaN           NaN        173.0

In [140]:
table_2 = table_1.merge(client_base, how='outer', on='client_id')

In [141]:
table_2

   client_id  rzd_revenue  auto_revenue  air_revenue          address
0        111       1093.0           NaN          NaN  Комсомольская 4
1        112       2810.0           NaN          NaN   Энтузиастов 8а
2        113      10283.0       57483.0          NaN  Левобережная 1а
3        114       5774.0          83.0          NaN          Мира 14
4        115        981.0         912.0         81.0        ЗЖБИиДК 1
5        116          NaN        4834.0          4.0    Строителей 18
6        117          NaN          98.0         13.0  Панфиловская 33
7        118          NaN           NaN        173.0     Мастеркова 4

### Задание 3

В задаче сквозной аналитики вам предоставили данные по местоположению пользователей. Т. е. для каждого user_id известна последовательность координат (широта/долгота), когда они требовались приложению для полноценной работы. Как бы вы добавили эти сведения в таблицу визитов и покупок? Для составления ответа можно использовать вопросы:
- У каждого пользователя известен набор координат. А для связывания с визитом или фактом покупки скорее всего потребуется одно-два числа. Как их получить?
- Наборы координат одного и того же пользователя могут быть значительно удалены друг от друга. Как это отразится на вопросе расчетах пункта 1?
- Какие дополнительные признаки можно получить из координат? Ведь это просто числа, которые сами по себе мало что дают.

По ощущениям чисто маркетинговая история. 

С такой базой можно понять, где у клиента зарождается "желание" зайти в приложение. То есть посмотреть концетрацию точек в пространстве и таким образом выявить лучшую рекламу. 

Далее можно отследить путь клиента от "желания" к "действию". Можно оценить во времени этот путь, правда пока не представляю, что с этим можно сделать. Но явно что-то можно, чтобы увеличить конверсию. 

Ну и про конверсию. Можно по user_id взять покупки, либо брошенные корзины, и сделать аналитику, в каком месте реклама не просто привлекает, но и побуждает к покупке. Можно же и понять категорию клиента. Если зарождения происходит возле условного "завода", то твой клиент - работяги. Если у бутиков, или в ТЦ - то клиент скорее всего имеет другой портрет и т.д. И тогда проверить корреляцию между стратегией компании и реальными клиентами :) 

Читая вопрос "Как бы вы добавили эти сведения в таблицу визитов и покупок?" - не знаю что имеется ввиду. Я бы практически вссегда использовал "outer" так как данные всегда ценны. 

А если вопрос про то, как соединить, то если прямой связи прям нет, то можно по времени пройтись. Выявить допустимый коридор и все.